---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MovesWithGridParam
source: html/0975f1bd-84d9-00c2-0a8b-d83000ae5223.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MovesWithGridParam Property

"Moves With Grids": Disable attachment from grids.

## Syntax (C#)
```csharp
public static ForgeTypeId MovesWithGridParam { get; }
```